Revit 2027 API
BuildingEnvelopeAnalyzer.Create Method
 Creates a new analyzer.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BuildingEnvelopeAnalyzer Create(
	Document document,
	BuildingEnvelopeAnalyzerOptions options
)
Public Shared Function Create (
	document As Document,
	options As BuildingEnvelopeAnalyzerOptions
) As BuildingEnvelopeAnalyzer
public:
static BuildingEnvelopeAnalyzer^ Create(
	Document^ document,
	BuildingEnvelopeAnalyzerOptions^ options
)
static member Create :
        document : Document *
        options : BuildingEnvelopeAnalyzerOptions -> BuildingEnvelopeAnalyzer
Parameters
document Document
 The document that contains the physical model of the building.
options BuildingEnvelopeAnalyzerOptions
 Options for the method analyzing the building elements for the building envelope.
Return Value
BuildingEnvelopeAnalyzer
 The created analyzer.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BuildingEnvelopeAnalyzer Class
Autodesk.Revit.DB.Analysis Namespace